InformationRegisters/Renault_ВидыРемонтаДопРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ВидыРемонтаДопРеквизиты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГарантияЗавода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EDR_ЛКМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаЛКМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ВидыРемонтаДопРеквизиты/Ext/ManagerModule.bsl
Процедура ЗаписатьПараметры(СтруктураПараметров) Экспорт	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ,СтруктураПараметров);
	МЗ.Прочитать(); //Всегда считываем
КонецПроцедуры

Функция ПолучитьГарантиюЗавода(ВидРемонта) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Renault_ВидыРемонтаДопРеквизиты.ГарантияЗавода
	|ИЗ
	|	РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК Renault_ВидыРемонтаДопРеквизиты
	|ГДЕ
	|	Renault_ВидыРемонтаДопРеквизиты.ВидРемонта = &ВидРемонта"
	);
	
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ГарантияЗавода;
	Иначе
		Результат = ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьEDR_ЛКМ(ВидРемонта) Экспорт

	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Renault_ВидыРемонтаДопРеквизиты.EDR_ЛКМ
	|ИЗ
	|	РегистрСведений.Renault_ВидыРемонтаДопРеквизиты КАК Renault_ВидыРемонтаДопРеквизиты
	|ГДЕ
	|	Renault_ВидыРемонтаДопРеквизиты.ВидРемонта = &ВидРемонта"
	);
	
	Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.EDR_ЛКМ;
	Иначе
		Результат = ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
